conn/SignatureService/SignDoc_CAdES_enveloping_KIM_nonQES.xml

<?xml version="1.0" encoding="UTF-8"?>
<s11:Envelope xmlns:s11='http://schemas.xmlsoap.org/soap/envelope/'>
	<s11:Body>
		<SIG:SignDocument xmlns:SIG='http://ws.gematik.de/conn/SignatureService/v7.4'>
			<CONN:CardHandle xmlns:CONN='http://ws.gematik.de/conn/ConnectorCommon/v5.0'>eb812b70-22e6-4239-992a-ba6c4b5a7398</CONN:CardHandle>
			<CCTX:Context xmlns:CCTX='http://ws.gematik.de/conn/ConnectorContext/v2.0'>
				<CONN:MandantId xmlns:CONN='http://ws.gematik.de/conn/ConnectorCommon/v5.0'>mandantid0365</CONN:MandantId>
				<CONN:ClientSystemId xmlns:CONN='http://ws.gematik.de/conn/ConnectorCommon/v5.0'>csid0365</CONN:ClientSystemId>
				<CONN:WorkplaceId xmlns:CONN='http://ws.gematik.de/conn/ConnectorCommon/v5.0'>GWTOP365</CONN:WorkplaceId>
				<CONN:UserId xmlns:CONN='http://ws.gematik.de/conn/ConnectorCommon/v5.0'>bert</CONN:UserId>
			</CCTX:Context>
			<SIG:TvMode>NONE</SIG:TvMode>
			<SIG:JobNumber>STH-469</SIG:JobNumber>
			<SIG:SignRequest RequestID='RequestID'>
				<SIG:OptionalInputs>
					<dss:SignatureType xmlns:dss='urn:oasis:names:tc:dss:1.0:core:schema'>urn:ietf:rfc:5652</dss:SignatureType>
					<dss:Properties xmlns:dss='urn:oasis:names:tc:dss:1.0:core:schema'>
						<dss:SignedProperties>
							<dss:Property>
								<dss:Identifier>RecipientEmailsAttribute</dss:Identifier>
								<dss:Value>
									<CMSAttribute>MIIBfgYIKoIUAEwEgS0xggFwMIGsFhR0ZXN0MUBoYmFrb250ZXN0Lm9yZzCBkzCBiDELMAkGA1UE
BhMCREUxHzAdBgNVBAoMFmdlbWF0aWsgR21iSCBOT1QtVkFMSUQxODA2BgNVBAsML0hlaWxiZXJ1
ZnNhdXN3ZWlzLUNBIGRlciBUZWxlbWF0aWtpbmZyYXN0cnVrdHVyMR4wHAYDVQQDDBVHRU0uSEJB
LUNBOCBURVNULU9OTFkCBnKFKnap/jCBvhYUdGVzdDJAc21ja29udGVzdC5vcmcwgaUwgZkxCzAJ
BgNVBAYTAkRFMR8wHQYDVQQKDBZnZW1hdGlrIEdtYkggTk9ULVZBTElEMUgwRgYDVQQLDD9JbnN0
aXR1dGlvbiBkZXMgR2VzdW5kaGVpdHN3ZXNlbnMtQ0EgZGVyIFRlbGVtYXRpa2luZnJhc3RydWt0
dXIxHzAdBgNVBAMMFkdFTS5TTUNCLUNBOCBURVNULU9OTFkCBwOcY3Q+c0c=</CMSAttribute>
								</dss:Value>
							</dss:Property>
						</dss:SignedProperties>
					</dss:Properties>
					<SIG:IncludeEContent>true</SIG:IncludeEContent>
				</SIG:OptionalInputs>
				<SIG:Document ShortText='KIM Mailmessage' ID='RequestID'>
					<dss:Base64Data xmlns:dss='urn:oasis:names:tc:dss:1.0:core:schema'>RnJvbTogVGltIFRlc3RlciA8dGltLnRlc3RlckBnZW1hdGlrLmRlPg0KVG86IGpvc2VmQGplZGVy
bWFubi5kZQ0KRGF0ZTogMjYgSmFuIDIwIDE0OjI5IFVUDQpTdWJqZWN0OiBFeGFtcGxlIHBsYWlu
IG1lc3NhZ2UNCk1JTUUtVmVyc2lvbjogMS4wDQpDb250ZW50LVR5cGU6IHRleHQvcGxhaW47IGNo
YXJzZXQ9dXMtYXNjaWk7DQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA4Yml0DQoNClRleHQg
bWl0IDEwIEtCDQoNCkRpZSBpc3QgZWluIEJlaXNwaWVsIGbDvHIgZWluZW4gQmxpbmR0ZXh0LCBk
ZXIgYXVmIGRldXRzY2ggZ2VzY2hyaWViZW4gDQppc3QuIEVzIGdpYnQgbm9jaCB2aWVsZSB3ZWl0
ZXJlIEFydGVuIGRlcyBIYXVzZXMsIHdvYmVpIGRpZSBlcnN0ZW4gDQpNZW5zY2hlbiBoZXV0ZSBu
aWNodCBzaW5kLiBadWRlbSBzaW5kIEJlaXNwaWVsZSBqZXR6dCBub2NoIGZyZWksIGRlbm4gDQpt
YW4gc29sbHRlIGJlZGVua2VuLCBkZXIgVGV4dCBtYWNodCB3ZW5pZyBTaW5uLiBNaXQgYnJhdXNl
bmRlciANCkdlc2Nod2luZGlna2VpdCB3YXIgZGVyIFRpdGVsIGRlcyBuZXVlbiBCb290cyBpbiBu
YWhlciBGZXJuZSwgd2VzaGFsYiANCnNpY2ggZGVyIEJyaWVmdHLDpGdlciBlaW5lbiByb3RlbiBN
YW50ZWwgenVyIFJlaW5pZ3VuZyBicmFjaHRlLiBFaW4gDQp3ZWl0ZXJlciBQdW5rdCB3w6RyZSBl
cywgZGllIHZlcnN0w6RuZGxpY2hlIEJsaW5kdGV4dGUgaGV1dGUgbm9jaCANCmFuenVydWZlbiBk
ZW5uIGRlciBUaXNjaCBzdGVodCBpbSBHYW5nLiBadXIgZGFtYWxpZ2VuIFplaXQgd2FyIGVzIGVo
ZXIgDQrDvGJsaWNoLCBkaWUgZ2VicmF1Y2h0ZW4gSGFuZHTDvGNoZXIgbWl0dGVscyBGZW5zdGVy
cmVpbmlnZXIgDQphdXN6dWzDvGZ0ZW4sIHVtIGF1Y2ggZGllIFdhbmR1aHIgYWxzIEJlaXNwaWVs
IHJpY2h0aWcgYXVzenVyaWNodGVuLiANCg0KRGEgc2l0enQgZXIgaW4gZWluZXIgVm9ybGVzdW5n
LCBkaWUgc2ljaCB3dW5kZXJ2b2xsIG5lbm50LiBEaWVzZSBTcGlubmUgDQplcm3DvGRldCBzaWNo
IGdlcmFkZSB3aWVkZXIuIERlc2hhbGIgaGFiZW4ga2VpbmUgZ3Jvw59lbiBUYWJlbGxlbiANCkF0
dHJpYnV0ZSB1bmQgc3RlaGVuIGltIFZlcmjDpGx0bmlzIGt1cnNpdi4gSW4gZGllc2VyIFdvY2hl
IGxlcm5lbiBkaWUgDQpTdHVkaWVyZW5kZW4gcmVsZXZhbnRlciBFcmVpZ25pc3NlIGVpZ2VudGxp
Y2ggbnVyIGtvbXBsZXR0ZW4gU3Bhc3MuIEFiZXIgDQphdXMgU2ljaCBkZXIgTWl0YXJiZWl0ZXIg
aXN0IGRlciBNZWludW5nLCBkYXNzIGFsbGVzIHdhcyB6dXp1b3JkbmVuIHdhciANClJlbGF2YW56
IHVuZCBFaW5mYWNoaGVpdCBpc3QuIA0KDQpFcyBpc3QgaGV1dGUgemllbWxpY2gga8O8aGxlcyBX
ZXR0ZXIgdW5kIGRpZSBTb25uZSBzY2hlaW50IGVpbiB3ZW5pZy4gDQpEaWVzZXIgQmVpc3BpZWx0
ZXh0IGRpZW50IGdlcmFkZSBlaW5lbiBFbnR3aWNrbGVyIHdlaWwgZGllIFJvc2UgYmzDvGh0IA0K
dW5kIG1hbiBzY2hyZWliZW4gc29sbC4gRGllIFBhcnRlaWVuIGdsYXViZW4gZG9jaCBuaWNodCBl
cm5zdGhhZnQsIGRhc3MgDQplcyBkYXMgQmVpc3BpZWwgYWxzIEJsaW5kdGV4dCBpc3QuIEVpbmUg
d2VpdGVyZSBLb25zdGFudGUgYmVmaW5kZXQgc2ljaCANCmFtIEhvcml6b250LiBJY2ggbXVzcyBt
aXIgZGFzIGR1cmNobGVzZW4uIFdhcyBhbHMgQmVpc3BpZWx0ZXh0IGdlbGVzZW4gDQp3aXJkLCBr
b21tdCBhdWYgZGllIEludGVycHJldGF0aW9uIGRlciB6dXZvciBlcm1pdHRlbHRlbiBEYXRlbiBh
bi4gRGllIA0KaXN0IGVpbiBCZWlzcGllbCBmw7xyIGVpbmVuIEJsaW5kdGV4dCwgZGVyIGF1ZiBk
ZXV0c2NoIGdlc2NocmllYmVuIGlzdC4gDQpFcyBnaWJ0IG5vY2ggdmllbGUgd2VpdGVyZSBBcnRl
biBkZXMgSGF1c2VzLCB3b2JlaSBkaWUgZXJzdGVuIE1lbnNjaGVuIA0KaGV1dGUgbmljaHQgc2lu
ZC4gWnVkZW0gc2luZCBCZWlzcGllbGUgamV0enQgbm9jaCBmcmVpLCBkZW5uIG1hbiBzb2xsdGUg
DQpiZWRlbmtlbiwgZGVyIFRleHQgbWFjaHQgd2VuaWcgU2lubi4gTWl0IGJyYXVzZW5kZXIgR2Vz
Y2h3aW5kaWdrZWl0IHdhciANCmRlciBUaXRlbCBkZXMgbmV1ZW4gQm9vdHMgaW4gbmFoZXIgRmVy
bmUsIHdlc2hhbGIgc2ljaCBkZXIgQnJpZWZ0csOkZ2VyIA0KZWluZW4gcm90ZW4gTWFudGVsIHp1
ciBSZWluaWd1bmcgYnJhY2h0ZS4gRWluIHdlaXRlcmVyIFB1bmt0IHfDpHJlIGVzLCANCmRpZSB2
ZXJzdMOkbmRsaWNoZSBCbGluZHRleHRlIGhldXRlIG5vY2ggYW56dXJ1ZmVuIGRlbm4gZGVyIFRp
c2NoIHN0ZWh0IA0KaW0gR2FuZy4gWnVyIGRhbWFsaWdlbiBaZWl0IHdhciBlcyBlaGVyIMO8Ymxp
Y2gsIGRpZSBnZWJyYXVjaHRlbiANCkhhbmR0w7xjaGVyIG1pdHRlbHMgRmVuc3RlcnJlaW5pZ2Vy
IGF1c3p1bMO8ZnRlbiwgdW0gYXVjaCBkaWUgV2FuZHVociANCmFscyBCZWlzcGllbCByaWNodGln
IGF1c3p1cmljaHRlbi4gDQoNCkRhIHNpdHp0IGVyIGluIGVpbmVyIFZvcmxlc3VuZywgZGllIHNp
Y2ggd3VuZGVydm9sbCBuZW5udC4gRGllc2UgU3Bpbm5lIA0KZXJtw7xkZXQgc2ljaCBnZXJhZGUg
d2llZGVyLiBEZXNoYWxiIGhhYmVuIGtlaW5lIGdyb8OfZW4gVGFiZWxsZW4gDQpBdHRyaWJ1dGUg
dW5kIHN0ZWhlbiBpbSBWZXJow6RsdG5pcyBrdXJzaXYuIEluIGRpZXNlciBXb2NoZSBsZXJuZW4g
ZGllIA0KU3R1ZGllcmVuZGVuIHJlbGV2YW50ZXIgRXJlaWduaXNzZSBlaWdlbnRsaWNoIG51ciBr
b21wbGV0dGVuIFNwYXNzLiBBYmVyIA0KYXVzIFNpY2ggZGVyIE1pdGFyYmVpdGVyIGlzdCBkZXIg
TWVpbnVuZywgZGFzcyBhbGxlcyB3YXMgenV6dW9yZG5lbiB3YXIgDQpSZWxhdmFueiB1bmQgRWlu
ZmFjaGhlaXQgaXN0LiANCg0KRXMgaXN0IGhldXRlIHppZW1saWNoIGvDvGhsZXMgV2V0dGVyIHVu
ZCBkaWUgU29ubmUgc2NoZWludCBlaW4gd2VuaWcuIA0KRGllc2VyIEJlaXNwaWVsdGV4dCBkaWVu
dCBnZXJhZGUgZWluZW4gRW50d2lja2xlciB3ZWlsIGRpZSBSb3NlIGJsw7xodCANCnVuZCBtYW4g
c2NocmVpYmVuIHNvbGwuIERpZSBQYXJ0ZWllbiBnbGF1YmVuIGRvY2ggbmljaHQgZXJuc3RoYWZ0
LCBkYXNzIA0KZXMgZGFzIEJlaXNwaWVsIGFscyBCbGluZHRleHQgaXN0LiBFaW5lIHdlaXRlcmUg
S29uc3RhbnRlIGJlZmluZGV0IHNpY2ggDQphbSBIb3Jpem9udC4gSWNoIG11c3MgbWlyIGRhcyBk
dXJjaGxlc2VuLiBXYXMgYWxzIEJlaXNwaWVsdGV4dCBnZWxlc2VuIA0Kd2lyZCwga29tbXQgYXVm
IGRpZSBJbnRlcnByZXRhdGlvbiBkZXIgenV2b3IgZXJtaXR0ZWx0ZW4gRGF0ZW4gYW4uIERpZSAN
CmlzdCBlaW4gQmVpc3BpZWwgZsO8ciBlaW5lbiBCbGluZHRleHQsIGRlciBhdWYgZGV1dHNjaCBn
ZXNjaHJpZWJlbiBpc3QuIA0KRXMgZ2lidCBub2NoIHZpZWxlIHdlaXRlcmUgQXJ0ZW4gZGVzIEhh
dXNlcywgd29iZWkgZGllIGVyc3RlbiBNZW5zY2hlbiANCmhldXRlIG5pY2h0IHNpbmQuIFp1ZGVt
IHNpbmQgQmVpc3BpZWxlIGpldHp0IG5vY2ggZnJlaSwgZGVubiBtYW4gc29sbHRlIA0KYmVkZW5r
ZW4sIGRlciBUZXh0IG1hY2h0IHdlbmlnIFNpbm4uIE1pdCBicmF1c2VuZGVyIEdlc2Nod2luZGln
a2VpdCB3YXIgDQpkZXIgVGl0ZWwgZGVzIG5ldWVuIEJvb3RzIGluIG5haGVyIEZlcm5lLCB3ZXNo
YWxiIHNpY2ggZGVyIEJyaWVmdHLDpGdlciANCmVpbmVuIHJvdGVuIE1hbnRlbCB6dXIgUmVpbmln
dW5nIGJyYWNodGUuIEVpbiB3ZWl0ZXJlciBQdW5rdCB3w6RyZSBlcywgDQpkaWUgdmVyc3TDpG5k
bGljaGUgQmxpbmR0ZXh0ZSBoZXV0ZSBub2NoIGFuenVydWZlbiBkZW5uIGRlciBUaXNjaCBzdGVo
dCANCmltIEdhbmcuIFp1ciBkYW1hbGlnZW4gWmVpdCB3YXIgZXMgZWhlciDDvGJsaWNoLCBkaWUg
Z2VicmF1Y2h0ZW4gDQpIYW5kdMO8Y2hlciBtaXR0ZWxzIEZlbnN0ZXJyZWluaWdlciBhdXN6dWzD
vGZ0ZW4sIHVtIGF1Y2ggZGllIFdhbmR1aHIgDQphbHMgQmVpc3BpZWwgcmljaHRpZyBhdXN6dXJp
Y2h0ZW4uIA0KDQpEYSBzaXR6dCBlciBpbiBlaW5lciBWb3JsZXN1bmcsIGRpZSBzaWNoIHd1bmRl
cnZvbGwgbmVubnQuIERpZXNlIFNwaW5uZSANCmVybcO8ZGV0IHNpY2ggZ2VyYWRlIHdpZWRlci4g
RGVzaGFsYiBoYWJlbiBrZWluZSBncm/Dn2VuIFRhYmVsbGVuIA0KQXR0cmlidXRlIHVuZCBzdGVo
ZW4gaW0gVmVyaMOkbHRuaXMga3Vyc2l2LiBJbiBkaWVzZXIgV29jaGUgbGVybmVuIGRpZSANClN0
dWRpZXJlbmRlbiByZWxldmFudGVyIEVyZWlnbmlzc2UgZWlnZW50bGljaCBudXIga29tcGxldHRl
biBTcGFzcy4gQWJlciANCmF1cyBTaWNoIGRlciBNaXRhcmJlaXRlciBpc3QgZGVyIE1laW51bmcs
IGRhc3MgYWxsZXMgd2FzIHp1enVvcmRuZW4gd2FyIA0KUmVsYXZhbnogdW5kIEVpbmZhY2hoZWl0
IGlzdC4gDQoNCkVzIGlzdCBoZXV0ZSB6aWVtbGljaCBrw7xobGVzIFdldHRlciB1bmQgZGllIFNv
bm5lIHNjaGVpbnQgZWluIHdlbmlnLiANCkRpZXNlciBCZWlzcGllbHRleHQgZGllbnQgZ2VyYWRl
IGVpbmVuIEVudHdpY2tsZXIgd2VpbCBkaWUgUm9zZSBibMO8aHQgDQp1bmQgbWFuIHNjaHJlaWJl
biBzb2xsLiBEaWUgUGFydGVpZW4gZ2xhdWJlbiBkb2NoIG5pY2h0IGVybnN0aGFmdCwgZGFzcyAN
CmVzIGRhcyBCZWlzcGllbCBhbHMgQmxpbmR0ZXh0IGlzdC4gRWluZSB3ZWl0ZXJlIEtvbnN0YW50
ZSBiZWZpbmRldCBzaWNoIA0KYW0gSG9yaXpvbnQuIEljaCBtdXNzIG1pciBkYXMgZHVyY2hsZXNl
bi4gV2FzIGFscyBCZWlzcGllbHRleHQgZ2VsZXNlbiANCndpcmQsIGtvbW10IGF1ZiBkaWUgSW50
ZXJwcmV0YXRpb24gZGVyIHp1dm9yIGVybWl0dGVsdGVuIERhdGVuIGFuLiBEaWUgDQppc3QgZWlu
IEJlaXNwaWVsIGbDvHIgZWluZW4gQmxpbmR0ZXh0LCBkZXIgYXVmIGRldXRzY2ggZ2VzY2hyaWVi
ZW4gaXN0LiANCkVzIGdpYnQgbm9jaCB2aWVsZSB3ZWl0ZXJlIEFydGVuIGRlcyBIYXVzZXMsIHdv
YmVpIGRpZSBlcnN0ZW4gTWVuc2NoZW4gDQpoZXV0ZSBuaWNodCBzaW5kLiBadWRlbSBzaW5kIEJl
aXNwaWVsZSBqZXR6dCBub2NoIGZyZWksIGRlbm4gbWFuIHNvbGx0ZSANCmJlZGVua2VuLCBkZXIg
VGV4dCBtYWNodCB3ZW5pZyBTaW5uLiBNaXQgYnJhdXNlbmRlciBHZXNjaHdpbmRpZ2tlaXQgd2Fy
IA0KZGVyIFRpdGVsIGRlcyBuZXVlbiBCb290cyBpbiBuYWhlciBGZXJuZSwgd2VzaGFsYiBzaWNo
IGRlciBCcmllZnRyw6RnZXIgDQplaW5lbiByb3RlbiBNYW50ZWwgenVyIFJlaW5pZ3VuZyBicmFj
aHRlLiBFaW4gd2VpdGVyZXIgUHVua3Qgd8OkcmUgZXMsIA0KZGllIHZlcnN0w6RuZGxpY2hlIEJs
aW5kdGV4dGUgaGV1dGUgbm9jaCBhbnp1cnVmZW4gZGVubiBkZXIgVGlzY2ggc3RlaHQgDQppbSBH
YW5nLiBadXIgZGFtYWxpZ2VuIFplaXQgd2FyIGVzIGVoZXIgw7xibGljaCwgZGllIGdlYnJhdWNo
dGVuIA0KSGFuZHTDvGNoZXIgbWl0dGVscyBGZW5zdGVycmVpbmlnZXIgYXVzenVsw7xmdGVuLCB1
bSBhdWNoIGRpZSBXYW5kdWhyIA0KYWxzIEJlaXNwaWVsIHJpY2h0aWcgYXVzenVyaWNodGVuLiAN
Cg0KRGEgc2l0enQgZXIgaW4gZWluZXIgVm9ybGVzdW5nLCBkaWUgc2ljaCB3dW5kZXJ2b2xsIG5l
bm50LiBEaWVzZSBTcGlubmUgDQplcm3DvGRldCBzaWNoIGdlcmFkZSB3aWVkZXIuIERlc2hhbGIg
aGFiZW4ga2VpbmUgZ3Jvw59lbiBUYWJlbGxlbiANCkF0dHJpYnV0ZSB1bmQgc3RlaGVuIGltIFZl
cmjDpGx0bmlzIGt1cnNpdi4gSW4gZGllc2VyIFdvY2hlIGxlcm5lbiBkaWUgDQpTdHVkaWVyZW5k
ZW4gcmVsZXZhbnRlciBFcmVpZ25pc3NlIGVpZ2VudGxpY2ggbnVyIGtvbXBsZXR0ZW4gU3Bhc3Mu
IEFiZXIgDQphdXMgU2ljaCBkZXIgTWl0YXJiZWl0ZXIgaXN0IGRlciBNZWludW5nLCBkYXNzIGFs
bGVzIHdhcyB6dXp1b3JkbmVuIHdhciANClJlbGF2YW56IHVuZCBFaW5mYWNoaGVpdCBpc3QuIA0K
DQpFcyBpc3QgaGV1dGUgemllbWxpY2gga8O8aGxlcyBXZXR0ZXIgdW5kIGRpZSBTb25uZSBzY2hl
aW50IGVpbiB3ZW5pZy4gDQpEaWVzZXIgQmVpc3BpZWx0ZXh0IGRpZW50IGdlcmFkZSBlaW5lbiBF
bnR3aWNrbGVyIHdlaWwgZGllIFJvc2UgYmzDvGh0IA0KdW5kIG1hbiBzY2hyZWliZW4gc29sbC4g
RGllIFBhcnRlaWVuIGdsYXViZW4gZG9jaCBuaWNodCBlcm5zdGhhZnQsIGRhc3MgDQplcyBkYXMg
QmVpc3BpZWwgYWxzIEJsaW5kdGV4dCBpc3QuIEVpbmUgd2VpdGVyZSBLb25zdGFudGUgYmVmaW5k
ZXQgc2ljaCANCmFtIEhvcml6b250LiBJY2ggbXVzcyBtaXIgZGFzIGR1cmNobGVzZW4uIFdhcyBh
bHMgQmVpc3BpZWx0ZXh0IGdlbGVzZW4gDQp3aXJkLCBrb21tdCBhdWYgZGllIEludGVycHJldGF0
aW9uIGRlciB6dXZvciBlcm1pdHRlbHRlbiBEYXRlbiBhbi4gRGllIA0KaXN0IGVpbiBCZWlzcGll
bCBmw7xyIGVpbmVuIEJsaW5kdGV4dCwgZGVyIGF1ZiBkZXV0c2NoIGdlc2NocmllYmVuIGlzdC4g
DQpFcyBnaWJ0IG5vY2ggdmllbGUgd2VpdGVyZSBBcnRlbiBkZXMgSGF1c2VzLCB3b2JlaSBkaWUg
ZXJzdGVuIE1lbnNjaGVuIA0KaGV1dGUgbmljaHQgc2luZC4gWnVkZW0gc2luZCBCZWlzcGllbGUg
amV0enQgbm9jaCBmcmVpLCBkZW5uIG1hbiBzb2xsdGUgDQpiZWRlbmtlbiwgZGVyIFRleHQgbWFj
aHQgd2VuaWcgU2lubi4gTWl0IGJyYXVzZW5kZXIgR2VzY2h3aW5kaWdrZWl0IHdhciANCmRlciBU
aXRlbCBkZXMgbmV1ZW4gQm9vdHMgaW4gbmFoZXIgRmVybmUsIHdlc2hhbGIgc2ljaCBkZXIgQnJp
ZWZ0csOkZ2VyIA0KZWluZW4gcm90ZW4gTWFudGVsIHp1ciBSZWluaWd1bmcgYnJhY2h0ZS4gRWlu
IHdlaXRlcmVyIFB1bmt0IHfDpHJlIGVzLCANCmRpZSB2ZXJzdMOkbmRsaWNoZSBCbGluZHRleHRl
IGhldXRlIG5vY2ggYW56dXJ1ZmVuIGRlbm4gZGVyIFRpc2NoIHN0ZWh0IA0KaW0gR2FuZy4gWnVy
IGRhbWFsaWdlbiBaZWl0IHdhciBlcyBlaGVyIMO8YmxpY2gsIGRpZSBnZWJyYXVjaHRlbiANCkhh
bmR0w7xjaGVyIG1pdHRlbHMgRmVuc3RlcnJlaW5pZ2VyIGF1c3p1bMO8ZnRlbiwgdW0gYXVjaCBk
aWUgV2FuZHVociANCmFscyBCZWlzcGllbCByaWNodGlnIGF1c3p1cmljaHRlbi4gDQoNCkRhIHNp
dHp0IGVyIGluIGVpbmVyIFZvcmxlc3VuZywgZGllIHNpY2ggd3VuZGVydm9sbCBuZW5udC4gRGll
c2UgU3Bpbm5lIA0KZXJtw7xkZXQgc2ljaCBnZXJhZGUgd2llZGVyLiBEZXNoYWxiIGhhYmVuIGtl
aW5lIGdyb8OfZW4gVGFiZWxsZW4gDQpBdHRyaWJ1dGUgdW5kIHN0ZWhlbiBpbSBWZXJow6RsdG5p
cyBrdXJzaXYuIEluIGRpZXNlciBXb2NoZSBsZXJuZW4gZGllIA0KU3R1ZGllcmVuZGVuIHJlbGV2
YW50ZXIgRXJlaWduaXNzZSBlaWdlbnRsaWNoIG51ciBrb21wbGV0dGVuIFNwYXNzLiBBYmVyIA0K
YXVzIFNpY2ggZGVyIE1pdGFyYmVpdGVyIGlzdCBkZXIgTWVpbnVuZywgZGFzcyBhbGxlcyB3YXMg
enV6dW9yZG5lbiB3YXIgDQpSZWxhdmFueiB1bmQgRWluZmFjaGhlaXQgaXN0LiANCg0KRXMgaXN0
IGhldXRlIHppZW1saWNoIGvDvGhsZXMgV2V0dGVyIHVuZCBkaWUgU29ubmUgc2NoZWludCBlaW4g
d2VuaWcuIA0KRGllc2VyIEJlaXNwaWVsdGV4dCBkaWVudCBnZXJhZGUgZWluZW4gRW50d2lja2xl
ciB3ZWlsIGRpZSBSb3NlIGJsw7xodCANCnVuZCBtYW4gc2NocmVpYmVuIHNvbGwuIERpZSBQYXJ0
ZWllbiBnbGF1YmVuIGRvY2ggbmljaHQgZXJuc3RoYWZ0LCBkYXNzIA0KZXMgZGFzIEJlaXNwaWVs
IGFscyBCbGluZHRleHQgaXN0LiBFaW5lIHdlaXRlcmUgS29uc3RhbnRlIGJlZmluZGV0IHNpY2gg
DQphbSBIb3Jpem9udC4gSWNoIG11c3MgbWlyIGRhcyBkdXJjaGxlc2VuLiBXYXMgYWxzIEJlaXNw
aWVsdGV4dCBnZWxlc2VuIA0Kd2lyZCwga29tbXQgYXVmIGRpZSBJbnRlcnByZXRhdGlvbiBkZXIg
enV2b3IgZXJtaXR0ZWx0ZW4gRGF0ZW4gYW4uIERpZSANCmlzdCBlaW4gQmVpc3BpZWwgZsO8ciBl
aW5lbiBCbGluZHRleHQsIGRlciBhdWYgZGV1dHNjaCBnZXNjaHJpZWJlbiBpc3QuIA0KRXMgZ2li
dCBub2NoIHZpZWxlIHdlaXRlcmUgQXJ0ZW4gZGVzIEhhdXNlcywgd29iZWkgZGllIGVyc3RlbiBN
ZW5zY2hlbiANCmhldXRlIG5pY2h0IHNpbmQuIFp1ZGVtIHNpbmQgQmVpc3BpZWxlIGpldHp0IG5v
Y2ggZnJlaSwgZGVubiBtYW4gc29sbHRlIA0KYmVkZW5rZW4sIGRlciBUZXh0IG1hY2h0IHdlbmln
IFNpbm4uIE1pdCBicmF1c2VuZGVyIEdlc2Nod2luZGlna2VpdCB3YXIgDQpkZXIgVGl0ZWwgZGVz
IG5ldWVuIEJvb3RzIGluIG5haGVyIEZlcm5lLCB3ZXNoYWxiIHNpY2ggZGVyIEJyaWVmdHLDpGdl
ciANCmVpbmVuIHJvdGVuIE1hbnRlbCB6dXIgUmVpbmlndW5nIGJyYWNodGUuIEVpbiB3ZWl0ZXJl
ciBQdW5rdCB3w6RyZSBlcywgDQpkaWUgdmVyc3TDpG5kbGljaGUgQmxpbmR0ZXh0ZSBoZXV0ZSBu
b2NoIGFuenVydWZlbiBkZW5uIGRlciBUaXNjaCBzdGVodCANCmltIEdhbmcuIFp1ciBkYW1hbGln
ZW4gWmVpdCB3YXIgZXMgZWhlciDDvGJsaWNoLCBkaWUgZ2VicmF1Y2h0ZW4gDQpIYW5kdMO8Y2hl
ciBtaXR0ZWxzIEZlbnN0ZXJyZWluaWdlciBhdXN6dWzDvGZ0ZW4sIHVtIGF1Y2ggZGllIFdhbmR1
aHIgDQphbHMgQmVpc3BpZWwgcmljaHRpZyBhdXN6dXJpY2h0ZW4uIA0KDQpEYSBzaXR6dCBlciBp
biBlaW5lciBWb3JsZXN1bmcsIGRpZSBzaWNoIHd1bmRlcnZvbGwgbmVubnQuIERpZXNlIFNwaW5u
ZSANCmVybcO8ZGV0IHNpY2ggZ2VyYWRlIHdpZWRlci4gRGVzaGFsYiBoYWJlbiBrZWluZSBncm/D
n2VuIFRhYmVsbGVuIA0KQXR0cmlidXRlIHVuZCBzdGVoZW4gaW0gVmVyaMOkbHRuaXMga3Vyc2l2
LiBJbiBkaWVzZXIgV29jaGUgbGVybmVuIGRpZSANClN0dWRpZXJlbmRlbiByZWxldmFudGVyIEVy
ZWlnbmlzc2UgZWlnZW50bGljaCBudXIga29tcGxldHRlbiBTcGFzcy4gQWJlciANCmF1cyBTaWNo
IGRlciBNaXRhcmJlaXRlciBpc3QgZGVyIE1laW51bmcsIGRhc3MgYWxsZXMgd2FzIHp1enVvcmRu
ZW4gd2FyIA0KUmVsYXZhbnogdW5kIEVpbmZhY2hoZWl0IGlzdC4gDQoNCkVzIGlzdCBoZXV0ZSB6
aWVtbGljaCBrw7xobGVzIFdldHRlciB1bmQgZGllIFNvbm5lIHNjaGVpbnQgZWluIHdlbmlnLiAN
CkRpZXNlciBCZWlzcGllbHRleHQgZGllbnQgZ2VyYWRlIGVpbmVuIEVudHdpY2tsZXIgd2VpbCBk
aWUgUm9zZSBibMO8aHQgDQp1bmQgbWFuIHNjaHJlaWJlbiBzb2xsLiBEaWUgUGFydGVpZW4gZ2xh
dWJlbiBkb2NoIG5pY2h0IGVybnN0aGFmdCwgZGFzcyANCmVzIGRhcyBCZWlzcGllbCBhbHMgQmxp
bmR0ZXh0IGlzdC4gRWluZSB3ZWl0ZXJlIEtvbnN0YW50ZSBiZWZpbmRldCBzaWNoIA0KYW0gSG9y
aXpvbnQuIEljaCBtdXNzIG1pciBkYXMgZHVyY2hsZXNlbi4gV2FzIGFscyBCZWlzcGllbHRleHQg
Z2VsZXNlbiANCndpcmQsIGtvbW10IGF1ZiBkaWUgSW50ZXJwcmV0YXRpb24gZGVyIHp1dm9yIGVy
bWl0dGVsdGVuIERhdGVuIGFuLiBEaWUgDQppc3QgZWluIEJlaXNwaWVsIGbDvHIgZWluZW4gQmxp
bmR0ZXh0LCBkZXIgYXVmIGRldXRzY2ggZ2VzY2hyaWViZW4gaXN0LiANCkVzIGdpYnQgbm9jaCB2
aWVsZSB3ZWl0ZXJlIEFydGVuIGRlcyBIYXVzZXMsIHdvYmVpIGRpZSBlcnN0ZW4gTWVuc2NoZW4g
DQpoZXV0ZSBuaWNodCBzaW5kLiBadWRlbSBzaW5kIEJlaXNwaWVsZSBqZXR6dCBub2NoIGZyZWks
IGRlbm4gbWFuIHNvbGx0ZSANCmJlZGVua2VuLCBkZXIgVGV4dCBtYWNodCB3ZW5pZyBTaW5uLiBN
aXQgYnJhdXNlbmRlciBHZXNjaHdpbmRpZ2tlaXQgd2FyIA0KZGVyIFRpdGVsIGRlcyBuZXVlbiBC
b290cyBpbiBuYWhlciBGZXJuZSwgd2VzaGFsYiBzaWNoIGRlciBCcmllZnRyw6RnZXIgDQplaW5l
biByb3RlbiBNYW50ZWwgenVyIFJlaW5pZ3VuZyBicmFjaHRlLiBFaW4gd2VpdGVyZXIgUHVua3Qg
d8OkcmUgZXMsIA0KZGllIHZlcnN0w6RuZGxpY2hlIEJsaW5kdGV4dGUgaGV1dGUgbm9jaCBhbnp1
cnVmZW4gZGVubiBkZXIgVGlzY2ggc3RlaHQgDQppbSBHYW5nLiBadXIgZGFtYWxpZ2VuIFplaXQg
d2FyIGVzIGVoZXIgw7xibGljaCwgZGllIGdlYnJhdWNodGVuIA0KSGFuZHTDvGNoZXIgbWl0dGVs
cyBGZW5zdGVycmVpbmlnZXIgYXVzenVsw7xmdGVuLCB1bSBhdWNoIGRpZSBXYW5kdWhyIA0KYWxz
IEJlaXNwaWVsIHJpY2h0aWcgYXVzenVyaWNodGVuLiANCg0KRGEgc2l0enQgZXIgaW4gZWluZXIg
Vm9ybGVzdW5nLCBkaWUgc2ljaCB3dW5kZXJ2b2xsIG5lbm50LiBEaWVzZSBTcGlubmUgDQplcm3D
vGRldCBzaWNoIGdlcmFkZSB3aWVkZXIuIERlc2hhbGIgaGFiZW4ga2VpbmUgZ3Jvw59lbiBUYWJl
bGxlbiANCkF0dHJpYnV0ZSB1bmQgc3RlaGVuIGltIFZlcmjDpGx0bmlzIGt1cnNpdi4gSW4gZGll
c2VyIFdvY2hlIGxlcm5lbiBkaWUgDQpTdHVkaWVyZW5kZW4gcmVsZXZhbnRlciBFcmVpZ25pc3Nl
IGVpZ2VudGxpY2ggbnVyIGtvbXBsZXR0ZW4gU3Bhc3MuIEFiZXIgDQphdXMgU2ljaCBkZXIgTWl0
YXJiZWl0ZXIgaXN0IGRlciBNZWludW5nLCBkYXNzIGFsbGVzIHdhcyB6dXp1b3JkbmVuIHdhciAN
ClJlbGF2YW56IHVuZCBFaW5mYWNoaGVpdCBpc3QuIA0KDQpFcyBpc3QgaGV1dGUgemllbWxpY2gg
a8O8aGxlcyBXZXR0ZXIgdW5kIGRpZSBTb25uZSBzY2hlaW50IGVpbiB3ZW5pZy4gDQoNCg==</dss:Base64Data>
				</SIG:Document>
				<SIG:IncludeRevocationInfo>false</SIG:IncludeRevocationInfo>
			</SIG:SignRequest>
		</SIG:SignDocument>
	</s11:Body>
</s11:Envelope>
